rails_wicked_pdf/app/controllers/resolution_reports_controller.rb

SELECT * FROM "resolution_reports"
---
  def index
    @resolution_reports = ResolutionReport.all

SELECT * FROM "resolution_reports" WHERE ("resolution_reports"."id" = 1)
---
  def show
    @resolution_report = ResolutionReport.find(params[:id])

SELECT * FROM "resolution_reports" WHERE ("resolution_reports"."id" = 1)
---
  def edit
    @resolution_report = ResolutionReport.find(params[:id])

INSERT INTO "resolution_reports" ("created_at", "updated_at", "show") VALUES('2011-05-26 05:34:07', '2011-05-26 05:34:07', 'asssssss')
---
  def create
    @resolution_report = ResolutionReport.new(params[:resolution_report])

    respond_to do |format|
      if @resolution_report.save