prawn_nokogiri/app/controllers/invoices_controller.rb

SELECT * FROM "invoices"
---
  def index
    @invoices = Invoice.all

SELECT * FROM "invoices" WHERE ("invoices"."id" = 1)
---
  def show
    @invoice = Invoice.find(params[:id])

SELECT * FROM "invoices" WHERE ("invoices"."id" = 1)
---
  def edit
    @invoice = Invoice.find(params[:id])

INSERT INTO "invoices" ("created_at", "updated_at", "html_content") VALUES('2011-06-03 03:47:09', '2011-06-03 03:47:09', '<p>ppppp</p>
---
  def create
    @invoice = Invoice.new(params[:invoice])

    respond_to do |format|
      if @invoice.save

SELECT * FROM "invoices" WHERE ("invoices"."id" = 1)
UPDATE "invoices" SET "updated_at" = '2011-06-06 01:24:59', "html_content" = '<br/>- hello<i>iiii</i> <br/>- li2 <br/>
---
  def update
    @invoice = Invoice.find(params[:id])

    respond_to do |format|
      if @invoice.update_attributes(params[:invoice])