pdf_rails/app/controllers/pdf2s_controller.rb

SELECT * FROM "pdf2s"
---
  def index
    @pdf2s = Pdf2.all

SELECT * FROM "pdf2s" WHERE ("pdf2s"."id" = 1)
---
  def show
    @pdf2 = Pdf2.find(params[:id])

SELECT * FROM "pdf2s" WHERE ("pdf2s"."id" = 1)
---
  def edit
    @pdf2 = Pdf2.find(params[:id])

INSERT INTO "pdf2s" ("created_at", "updated_at", "htmlcontent") VALUES('2011-05-26 02:35:51', '2011-05-26 02:35:51', 'hello')
---
  def create
    @pdf2 = Pdf2.new(params[:pdf2])

    respond_to do |format|
      if @pdf2.save

SELECT * FROM "pdf2s" WHERE ("pdf2s"."id" = 1)
---
  def update
    @pdf2 = Pdf2.find(params[:id])