pdf_rails/app/controllers/pdf3s_controller.rb

SELECT * FROM "pdf3s"
---
  def index
    @pdf3s = Pdf3.all

SELECT * FROM "pdf3s" WHERE ("pdf3s"."id" = 1)
---
  def show
    @pdf3 = Pdf3.find(params[:id])

SELECT * FROM "pdf3s" WHERE ("pdf3s"."id" = 1)
---
  def edit
    @pdf3 = Pdf3.find(params[:id])

INSERT INTO "pdf3s" ("created_at", "updated_at", "htmlcontent") VALUES('2011-05-26 00:32:29', '2011-05-26 00:32:29', '<ul> <li> <em>Resolved,</em> the House of _______ concurring, That&nbsp;</li> </ul> <p> Hello, h<strong>ere is </strong>the</p>')
---
  def create
    @pdf3 = Pdf3.new(params[:pdf3])

    respond_to do |format|
      if @pdf3.save

SELECT * FROM "pdf3s" WHERE ("pdf3s"."id" = 2)
UPDATE "pdf3s" SET "updated_at" = '2011-05-26 00:38:23', "htmlcontent" = '<ul> <li> <em>Resolved,</em> the House of _______ concurring, That&nbsp;</li><li> <em>Resolved,</em> the House of _______ concurring, That&nbsp;</li> </ul> <p> Hello, h<strong>ere is </strong>the</p>' WHERE "id" = 2
---
  def update
    @pdf3 = Pdf3.find(params[:id])

    respond_to do |format|
      if @pdf3.update_attributes(params[:pdf3])