pdf_rails/app/controllers/pdfs_controller.rb

SELECT * FROM "pdfs"
---
  def index
    @pdfs = Pdf.all

SELECT * FROM "pdfs" WHERE ("pdfs"."id" = 1)
---
  def show
    @pdf = Pdf.find(params[:id])

SELECT * FROM "pdfs" WHERE ("pdfs"."id" = 1)
---
  def edit
    @pdf = Pdf.find(params[:id])

INSERT INTO "pdfs" ("created_at", "updated_at", "content1") VALUES('2011-05-26 03:07:35', '2011-05-26 03:07:35', 'adfadfasd')
---
  def create
    @pdf = Pdf.new(params[:pdf])

    respond_to do |format|
      if @pdf.save

SELECT * FROM "pdfs" WHERE ("pdfs"."id" = 1)
UPDATE "pdfs" SET "updated_at" = '2011-05-26 03:11:07', "content1" = 'adfadfasddsfadf' WHERE "id" = 1
---
  def update
    @pdf = Pdf.find(params[:id])

    respond_to do |format|
      if @pdf.update_attributes(params[:pdf])